{
  "irVersion": "1.0",
  "project": "devfolio",
  "repository": "https://github.com/plexusone/devfolio",
  "versioning": "semver",
  "commitConvention": "conventional",
  "maintainers": ["plexusone"],
  "releases": [
    {
      "version": "v0.1.0",
      "date": "2026-02-28",
      "highlights": [
        { "description": "Developer portfolio and team velocity metrics CLI" },
        { "description": "AI collaboration tracking to measure how AI-native developers are" }
      ],
      "added": [
        { "description": "CLI with `contributor` and `team` command groups", "commit": "6711408" },
        { "description": "`contributor profile` command to generate comprehensive contributor profiles from GitHub activity", "commit": "bb0c219" },
        { "description": "Profile types including commits, PRs, issues, reviews, and repository breakdown", "commit": "ba04549" },
        { "description": "GitHub API client for fetching user contributions and activity heatmap data", "commit": "75da28a" },
        { "description": "AI collaboration tracking via `Co-Authored-By` trailer parsing in commit messages", "commit": "ba04549" },
        { "description": "Known AI tools registry: Claude Code, GitHub Copilot, Gemini CLI, Cursor, Aider", "commit": "ba04549" },
        { "description": "AI commit statistics including percentage, most-used tool, first AI commit date, and trend", "commit": "ba04549" },
        { "description": "Activity heatmap data for GitHub-style contribution calendars", "commit": "75da28a" },
        { "description": "`team velocity` placeholder command for team metrics", "commit": "6711408" }
      ],
      "infrastructure": [
        { "description": "GitHub Actions workflows for CI, lint, and SAST via reusable workflows", "commit": "a562858" },
        { "description": "Dependabot configuration for daily gomod and github-actions updates", "commit": "a562858" }
      ],
      "documentation": [
        { "description": "Project README with usage examples and feature overview", "commit": "25b5cf7" }
      ]
    }
  ]
}
